billwanggithub/Fan-TestKit-ESP32/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash + PSRAM (N16R8 module)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Partition table
# Secure Boot V2 + Flash Encryption grows the signed bootloader past the
# default 0x8000 limit, so push the partition table offset to 0xE000
# (56 KB of bootloader room, comfortable for v5.5 Secure Boot V2 + ~40 KB).
# CONFIG_PARTITION_TABLE_TYPE is a choice; we must explicitly unset the
# other members to override a previously-generated sdkconfig.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_SINGLE_APP=n
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=n
CONFIG_PARTITION_TABLE_TWO_OTA=n
CONFIG_PARTITION_TABLE_TWO_OTA_LARGE=n
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xE000

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Logging (UART0 console via USB1 / CH343P)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# CONFIG_LOG_MAXIMUM_LEVEL is a choice group — list all members explicitly so
# this override survives a stale sdkconfig (CLAUDE.md sdkconfig trap).
#
# **Workaround for v6.0 MCPWM band-cross bug**: with the choice at default
# (LOG_MAXIMUM_EQUALS_DEFAULT, max=INFO), `pwm_gen` produces a 16× too-high
# output frequency on the FIRST cross from HI band → LO band (e.g. asking
# for 100 Hz outputs 1.6 kHz). Bumping max to DEBUG and the runtime
# `esp_log_level_set("mcpwm", ESP_LOG_DEBUG)` in pwm_gen_init() together
# make the bug disappear, even though neither call should have hardware
# effect. Suspected cause: extra microseconds inside the driver's LOGD
# argument formatting let some MCPWM register write settle before the next
# read, but root cause is not isolated. Removing this Kconfig OR removing
# the esp_log_level_set call brings the bug back. Cost: ~few KB of LOGD
# format strings linked in. See HANDOFF.md "Open issues" for follow-up.
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=n
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=n

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y

# OTA / Secure Boot / Flash Encryption
# 第一次 bring-up 暫時關掉 Secure Boot V2 + Flash Encryption。一旦
# firmware 驗證可以 boot、跑得起來，再依 docs/release-hardening.md
# 逐步把 security features 打開。**注意：** 現階段這顆 chip 的 eFuse
# 尚未被燒寫（boot loop 發生在 secure-boot digest burn 之前），所以
# 改回 n 是 safe 的；一旦 Secure Boot 或 Flash Enc 曾經成功 boot 過
# 一次，eFuse 就無法回頭，不能再套用 Plan A。
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK=n

CONFIG_SECURE_BOOT=n
CONFIG_SECURE_FLASH_ENC_ENABLED=n

# HTTPD / WebSocket
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# TinyUSB (composite: HID + CDC) — esp_tinyusb 1.7.x Kconfig options.
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1

# mDNS service for dashboard discovery (`esp32-pwm.local`). Default
# MAX_SERVICES=10 is fine, but we pin it explicitly so cleaning
# sdkconfig doesn't silently drop below 1.
CONFIG_MDNS_MAX_SERVICES=4

# Power
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
